###############################################################
#  Generated by:      Cadence Innovus 21.19-s058_1
#  OS:                Linux x86_64(Host ID compute3.eng.umd.edu)
#  Generated on:      Tue May 20 13:45:33 2025
#  Design:            snn_fixed_16_2_4_4_2
#  Command:           saveDesign work/design/snn_fixed_16_2_4_4_2_placed.enc
###############################################################
current_design snn_fixed_16_2_4_4_2
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 200000.000000 -waveform {0.000000 100000.000000}
set_driving_cell -lib_cell scs130lp_buf_0 -library scs130lp_tt_1.62_25 -rise -min -pin X [get_ports {rst_n}]
set_driving_cell -lib_cell scs130lp_buf_0 -library scs130lp_tt_1.62_25 -fall -min -pin X [get_ports {rst_n}]
set_driving_cell -lib_cell scs130lp_buf_0 -library scs130lp_tt_1.62_25 -rise -max -pin X [get_ports {rst_n}]
set_driving_cell -lib_cell scs130lp_buf_0 -library scs130lp_tt_1.62_25 -fall -max -pin X [get_ports {rst_n}]
set_driving_cell -lib_cell scs130lp_buf_0 -library scs130lp_tt_1.62_25 -rise -min -pin X [get_ports {clk}]
set_driving_cell -lib_cell scs130lp_buf_0 -library scs130lp_tt_1.62_25 -fall -min -pin X [get_ports {clk}]
set_driving_cell -lib_cell scs130lp_buf_0 -library scs130lp_tt_1.62_25 -rise -max -pin X [get_ports {clk}]
set_driving_cell -lib_cell scs130lp_buf_0 -library scs130lp_tt_1.62_25 -fall -max -pin X [get_ports {clk}]
set_driving_cell -lib_cell scs130lp_buf_0 -library scs130lp_tt_1.62_25 -rise -min -pin X [get_ports {spike_in[1]}]
set_driving_cell -lib_cell scs130lp_buf_0 -library scs130lp_tt_1.62_25 -fall -min -pin X [get_ports {spike_in[1]}]
set_driving_cell -lib_cell scs130lp_buf_0 -library scs130lp_tt_1.62_25 -rise -max -pin X [get_ports {spike_in[1]}]
set_driving_cell -lib_cell scs130lp_buf_0 -library scs130lp_tt_1.62_25 -fall -max -pin X [get_ports {spike_in[1]}]
set_driving_cell -lib_cell scs130lp_buf_0 -library scs130lp_tt_1.62_25 -rise -min -pin X [get_ports {spike_in[0]}]
set_driving_cell -lib_cell scs130lp_buf_0 -library scs130lp_tt_1.62_25 -fall -min -pin X [get_ports {spike_in[0]}]
set_driving_cell -lib_cell scs130lp_buf_0 -library scs130lp_tt_1.62_25 -rise -max -pin X [get_ports {spike_in[0]}]
set_driving_cell -lib_cell scs130lp_buf_0 -library scs130lp_tt_1.62_25 -fall -max -pin X [get_ports {spike_in[0]}]
set_load -pin_load -max  1  [get_ports {spike_out[1]}]
set_load -pin_load -min  1  [get_ports {spike_out[1]}]
set_load -pin_load -max  1  [get_ports {spike_out[0]}]
set_load -pin_load -min  1  [get_ports {spike_out[0]}]
set_wire_load_mode enclosed
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {spike_in[1]}]
set_input_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {spike_in[0]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {spike_out[0]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {spike_out[1]}]
set_clock_uncertainty 0.1 [get_clocks {clk}]
